БПКР/src/InformationRegisters/СтавкиЕН/СтавкиЕН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиЕН</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаНаличная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаБезналичная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>EnumRef.ВидыДеятельностиЕН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/ВидыДеятельностиЕН/ВидыДеятельностиЕН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДеятельностиЕН</name>
  <enumValues>
    <name>ПереработкаПроизводствоТорговля</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РежимУсловногоНачисленияНДС</name>
  </enumValues>
  <enumValues>
    <name>ШвейноеТекстильноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
  <enumValues>
    <name>УслугиСаун</name>
  </enumValues>
  <enumValues>
    <name>УслугиБильярда</name>
  </enumValues>
  <enumValues>
    <name>УслугиБань</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/InformationRegisters/СтавкиЕН/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	 Для Каждого Запись из ЭтотОбъект Цикл
		 
		 Если Запись.СтавкаНаличная <> Запись.СтавкаБезналичная 
		 	И ПроверяемыйВидДеятельности(Запись.ВидДеятельности) Тогда  
		 	
		 	ТекстСообщения = НСтр("ru = 'Ставки для данного вида деятельности должны быть равны.'");
		 	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "СтавкаНаличная",, Отказ);
		 	
		 КонецЕсли;
		 
	 КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверяемыйВидДеятельности(ВидДеятельности)
	
	Если ВидДеятельности = Перечисления.ВидыДеятельностиЕН.РежимУсловногоНачисленияНДС
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.ШвейноеТекстильноеПроизводство 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.Услуги 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиСаун 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиБильярда 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиБань  Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
